## Introduction to Pandas 
pandas is a very robouts package that manages data in rows and columns as a data frame

#### Pandas Series
+ basically a souped up python list with aditional methods
+ all the data in the series needs to be the same type, or is coerrced to the same type
+ supports lots of methods of indexing, and filtering
+ lists may be a range of integers (default) but can be much more complex

In [47]:
# how to read a comma seperate file into panadas
import pandas as pd

# pandas series are 1 dimenssions arrays with some extara functins build in
# indexes in pandas are typically integers, but could be other items

x = pd.Series(['a', 'b', 'c'])
# access elements similar to a list or array
print('indexing a series "x[1]" = ', x[1])

# demonstrates remapping the index to another list
x.index = ['x', 'y', 'z']
print('replacing the index with a list of strings and indexing x["y"] = ' , x['y'])

# iloc method for series still uses a integer index

print('this is how use use iloc to get the 1 position element "x.iloc[1]" = ', x.iloc[1])

# prints out what the data is stored as
x.dtype

indexing a series "x[1]" =  b
replacing the index with a list of strings and indexing x["y"] =  b
this is how use use iloc to get the 1 position element "x.iloc[1]" =  b

dtype('O')

## Pandas Dataframes
+ stores data in rows and columns
+ each column must only have one data type
+ columns or rows or both are indexable
+ data frames are mutable

### Data Shaping
 + .groupby(by='loc').sum() ensure that every unique value in the 'loc' column has a row, sum is applied to all numeric columns
 +

In [48]:
# pandas data frama is essentially a python version of a spreadsheet with all sorts of build in methods
# consider
# typically a data frame is initialized from a dictionary or csv file
d = {'loc': ['relevator', 'relevator', 'kudu', 'work', 'home'],
     'cost': [4.25, 3.25, 3.43, 2.00, 0.25],
     'cups': [2, 1, 1, 2, 1],
     'time': ['afternoon', 'afternoon', 'morning', 'morning', 'morning']}
data = pd.DataFrame(d)

# get data types
data.dtypes

# sort data by cost, and then time
data.sort_values(['cost', 'loc'])

# aggregate 
print('sum', data['cost'].sum())

# select only certain rows using loc method
data.loc[data['loc'] == 'relevator']

# select rows and columns using iloc method
data.iloc[1:, 2]

sum 13.18

1    1
2    1
3    2
4    1
Name: cups, dtype: int64

###  Shaping - Advanced Selecting and Filtering using .loc
+ multi condition filter using | or & (| stands for or, & for and)
    + Syntax is:    data.loc[(data['colname'] == val) & (data['colname'] == val)]

+ filtering where values are in a set in set 
+ fundimentally, .loc needs an array of True, False statements the same number of rows, that's what is being created in the methods inside the square brackets

In [49]:
# for numeric values, great less than 1 or greater than 4
data.loc[(data['cost'] < 1) | (data['cost'] > 4) ]

         loc  cost  cups       time
0  relevator  4.25     2  afternoon
4       home  0.25     1    morning

In [50]:
# Location is Relivator and 1 and cost > 2
data.loc[(data['loc'] == 'relevator') &  (data['cost'] > 2) ]

         loc  cost  cups       time
0  relevator  4.25     2  afternoon
1  relevator  3.25     1  afternoon

In [51]:
# Select time only where it's in list  ['afternoon', 'morning']
data.loc[data['time'].isin( ['afternoon', 'morning'])]

         loc  cost  cups       time
0  relevator  4.25     2  afternoon
1  relevator  3.25     1  afternoon
2       kudu  3.43     1    morning
3       work  2.00     2    morning
4       home  0.25     1    morning

## Melting, collasping columns into rows
the .melt(value_vars=['cups', 'cost'], id_vars='loc') will combine cups and cost into a column name varirable with a column call values to hold the the actual varlues

In [52]:
# melting (the opposite of group by
x = data.melt(value_vars=['cups', 'cost'], id_vars='loc')
print(x.head())

         loc variable  value
0  relevator     cups    2.0
1  relevator     cups    1.0
2       kudu     cups    1.0
3       work     cups    2.0
4       home     cups    1.0

## Pivoting, turning rows into columns
+ maintains the same number of rows as the original data, 
+ the columns arg makes a new column for each unique in the column

In [53]:

x = data.pivot(columns='time', values='cups')
print(x)

time  afternoon  morning
0           2.0      NaN
1           1.0      NaN
2           NaN      1.0
3           NaN      2.0
4           NaN      1.0

### Aggreation with pandas 
use the .groupby(by=) method, the by column means every unique value in the column with have one and only one row
is followed by an aggreation function
+ aggregation is applied to all numeric columns

In [54]:
data.groupby(by='loc').sum()

           cost  cups
loc
home       0.25     1
kudu       3.43     1
relevator  7.50     3
work       2.00     2

## Joining with Pandas, using data.merge()
+ .merge method joins two data sets together
+ left_on='' right_on='' can specifiy specific keys for joining, else overlapping colnames are used 
+ 'how's specifies inner left, right, outer

In [55]:
# Joining Data 

s = {'loc': ['relevator', 'kudu', 'work', 'daycare'],
         'area': ['charleston pen', 'charleston pen', 'west ashly','west ashly']}
places = pd.DataFrame(s)

# consider
# typically a data frame is initialized from a dictionary or csv file
d = {'loc': ['relevator', 'relevator', 'kudu', 'work', 'home'],
     'cost': [4.25, 3.25, 3.43, 2.00, 0.25],
     'cups': [2, 1, 1, 2, 1],
     'time': ['afternoon', 'afternoon', 'morning', 'morning', 'morning']}
data = pd.DataFrame(d)
## Inner Join (only commen elements based on a key
# default

print('inner join  \n', data.merge(places))

# left 
print('left join  \n', data.merge(places, how='left'))

print('right join  \n', data.merge(places, how='right'))

# outer all elements of all groups, fills with Nan by default.
print('outer join \n', data.merge(places, how='outer'))

inner join
          loc  cost  cups       time            area
0  relevator  4.25     2  afternoon  charleston pen
1  relevator  3.25     1  afternoon  charleston pen
2       kudu  3.43     1    morning  charleston pen
3       work  2.00     2    morning      west ashly
left join
          loc  cost  cups       time            area
0  relevator  4.25     2  afternoon  charleston pen
1  relevator  3.25     1  afternoon  charleston pen
2       kudu  3.43     1    morning  charleston pen
3       work  2.00     2    morning      west ashly
4       home  0.25     1    morning             NaN
right join
          loc  cost  cups       time            area
0  relevator  4.25   2.0  afternoon  charleston pen
1  relevator  3.25   1.0  afternoon  charleston pen
2       kudu  3.43   1.0    morning  charleston pen
3       work  2.00   2.0    morning      west ashly
4    daycare   NaN   NaN        NaN      west ashly
outer join
          loc  cost  cups       time            area
0  relevator  4.25   2.0  afternoon  charleston pen
1  relevator  3.25   1.0  afternoon  charleston pen
2       kudu  3.43   1.0    morning  charleston pen
3       work  2.00   2.0    morning      west ashly
4       home  0.25   1.0    morning             NaN
5    daycare   NaN   NaN        NaN      west ashly

## Week 2
### Day 1 Python 3.6 installation with jupter notebooks

### Day 2 Python Basics Continued
+ requesting data from git hub via pandas, using a url
+ Make sure to request the  'raw' data, not just the html that's displaying the data (when requesting on git)

In [56]:
## loads congressional age data set
import pandas as pd

url = 'https://raw.githubusercontent.com/fivethirtyeight/data/master/congress-age/congress-terms.csv'
data = pd.read_csv(url)
data.head()

,congress,chamber,bioguide,firstname,middlename,lastname,suffix,birthday,state,party,incumbent,termstart,age
0,80,house,M000112,Joseph,Jefferson,Mansfield,NaN,1861-02-09,TX,D,Yes,1947-01-03,85.9
1,80,house,D000448,Robert,Lee,Doughton,NaN,1863-11-07,NC,D,Yes,1947-01-03,83.2
2,80,house,S000001,Adolph,Joachim,Sabath,NaN,1866-04-04,IL,D,Yes,1947-01-03,80.7
3,80,house,E000023,Charles,Aubrey,Eaton,NaN,1868-03-29,NJ,R,Yes,1947-01-03,78.8
4,80,house,L000296,William,NaN,Lewis,NaN,1868-09-22,KY,R,No,1947-01-03,78.3

#### Aggreations in Action
Is the house or the senate older?

In [57]:
data.groupby('chamber').mean()['age']

chamber
house     52.366611
senate    57.335529
Name: age, dtype: float64

#### Aggregation combined with filtering, and sorting to answer questions
What was the congressional Term with the oldest House Members?

In [58]:
data[data['chamber'] == 'house'].groupby('congress').mean().sort_values('age').tail(1)

                age
congress
113       56.754214


#### Aggregation Combined with Pivoting and filtering
Are the democrates or republicans older in the last three congresses ?

In [59]:
data_filtered = data[data['party'].str.contains('D|R')]  ## cpntains 'D' or 'R' to get rid of independents
data_pivoted = data_filtered.groupby(['party', 'congress']).mean()
data_pivoted.head()

                      age
party congress
D     80        52.006883
      81        51.430303
      82        52.295890
      83        52.258029
      84        52.254861